class Question {

    question;
    options;
    currectOption;

    constructor(question,options,currectOption){
        this.question = question;
        this.options = options;
        this.currectOption = currectOption;
    }

    checkIfCurrect(option){
        if(option==this.currectOption){
            return true;
        }
        return false;
    }
}

const wisdoms = [
  "بالنسبة للبعض ، يمكن أن تكون إعادة تقييم المفاهيم حول الحقيقة والواقع اقتراحًا مخيفًا.",
  "النجاح أن تكون مستعدا للقيام بأمور لم يقم بها أحد من قبل. ",
  "النجاح لا يأتي الا بعد الشعور بالالم.",//0
  "ان لكل متغير قيمة تؤدي إلى نتيجة فاختر متغيراتك جيدًا لتصل الى مرادك ."
]

let n = Math.floor(Math.random()*4) 

const  questions  =  [
  {
    "question": "من ام النبي محمد صلى الله عليخ وسلم ",
    "options":[
      "خديجة بنت خويلد",
       "آمنة بنت وهب ",
       "زينب بنت خزيمة",
       "فاطمة بنت محمد"
    ],
    "currectOption": null
  },{
  "question": "فازت السعودية في كاس العالم قطر 2022 على؟ ",
  "options":[
    "بولندا",
    "المكسيك",
     "الارجتنين",
     " ايرندا"
  ],
  "currectOption": 1
},{
  "question": "متى يبدأ دخول الوسم ",
  "options":[
    "ديسمبر",
     "رمضان",
     " اكتوبر",
     " ابريل "
  ],
  "currectOption": 2
},{
  "question": "كان خاتم الرسول صلى الله عليه وسلم من ",
  "options":[
    "النحاس",
    "الفضه",
    "الجلد",
    " الخيط "
  ],
  "currectOption": 2
},{
        "question": "ماهي المسافة الواقعة بين مسجد السندة ودوار الفروسية؟ ",
        "options":[
            "10 كيلو",
            "13 كيلو",
            "15 كيلو",
            "18 كيلو"
        ],
        "currectOption": 1
    },{
        "question": "كلمة من الماضي ماذا تعني الطاية ",
        "options":[
            "السطح",
            "الكورة",
            "باب السحب",
            "الحوش الواسع"//this
        ],
        "currectOption": 2
},{
        "question": "ماذا يعني الطرجد",
        "options":[
            "حافظة الاكل",
            "الطاحون",
            "مكنسة",
            "الزير"//this
        ],
        "currectOption": 0
},{
  "question": "اختر الشكل الذي تعتقد ان الاكثرية سوف يختارونه",
  "options":[
"◥◤",
"෴",
"ω",
"っ"
  ], 
  "currectOption": 2 ,

},{
  "question": "هل تريد الاستمرار",
  "options":[
    "نعم",
     "لا",
     "سوف افكر",
     "ابدا"
  ],
  "sp" : true
},{
  "question": "اقم الصلاه لدلوك الشمس، ماهو الدلوك ؟ ",
  "options":[
    "ارتكاز",
     "ظهور",
     "عمودية",
     "زوال"
  ],
  "currectOption": 0
},{
        "question": "ما هو الشيء الذي تستطيع الوقوف عليه ولكنك لا تستطيع الوقوف عليه مدى الحياة",
        "options":[
            "الجسر",
            "السرير",
            "السلم",
            "الثلج"//this
  ],
  "currectOption": 3
},{
  "question": "ماهي الحكمة التي ظهرت لك في البداية",
  "options":wisdoms,
  "currectOption": 3
},
{
  "question": "حيوان يتحمل العطش اكثر من الجمل ",
  "options":[
    "القط",
     "الفيل",
     "الزرافة",
     "لايوجد"//this
  ],
  "currectOption": n
},{
  "question": "اذا كان احمد كابتن طائرة , فإن نفي نفي النفي للعبارة هي ",
  "options":[
    "احمد كابتن سفينة",
     "احمد ليس كابتن طائرة",//this
     "احمد كابتن طائرة",
     "احمد ليس ليس كابتن طائرة"
  ],
  "currectOption": 2
},{
  "question": "   هنالك يوتبوبر نادر جدا ان تجد له مقطع واحد لا تقل  مشاهداته عن 100 مليون ,اعطني حقيقه لا يمكن انكارها ",
  "options":[
    "   جميع المقاطع تتعدى ال 100 مليون مشاهده"  ,
     "جميع المقاطع اقل من 100 مليون مشاهده",
     "يوجد مقطع واحد على الاكثر يقل عن 100  مليون مشاهده",
     "يوجد مقطع واحد على الاقل تقل عن 100 مليون مشاهده"//this
  ],
  "currectOption": 1
},{
  "question": "ما هو العضو الذي يتولى السلطة التنفيذية في الولايات المتحدة الأمريكية؟",
  "options":[
    "الكونجرس",
     "حاكم الولاية",
     "القاضي العليا",
     "الرئيس"//this
  ],
  "currectOption": 3
},{
  "question": "ما هو الشيء الذي يمشي بأربعة أرجل في الصباح، بثلاثة أرجل في الظهيرة، وباثنين في المساء",
  "options":[
    "الإنسان",
     "الكلب",
     "الحصان",
     "الضفدع"//this
  ],
  "currectOption": 3
},
{
  "question": "ما هو الشيء الذي يأتي مرة في الدقيقة، مرتين في اللحظة، ولا يأتي مرة في الساعة",
  "options":[
    "الثانية",
     "الدقيقة",
     "اللحظة",
     "الساعة"//this
  ],
  "currectOption": 0
},
{
  "question": "",
  "options":[
    "",
     "",
     "",
     ""//this
  ],
  "currectOption": 0
},

]


// const questions = [
//     new Question("lorem lorem" , ["yasir" , "ali" , "Areen" , "khalid"] , 0),
//     new Question("what is my name2" , ["yasir" , "ali" , "Areen" , "khalid"] , 0),
//     new Question("what is my name3" , ["yasir" , "ali" , "Areen" , "khalid"] , 2)]

const q =  [
    {
      "question": "ما هي الحيوانات التي تحتوي على أكبر عدد من الأسنان؟",
      "options":[
         "الفيل",
         "القرش",
         "الحوت الأحدب",
         "الكلب"
      ],
      "currectOption": "a"
    },
    {
      "question": "ما هي الحيوانات التي تعيش فقط في أستراليا؟",
      "options":[
         "الكنغر",
         "البومة الأسترالية",
         "الكوالا",
         "الكركدن"
      ],
      "currectOption": 0
    },
    {
      "question": "ما هو البحر الذي يحتوي على أعلى مستوى للملوحة في العالم؟",
      "options":[
         "بحر الميت",
         "بحر البلطيق",
         "بحر الأعشاب",
         "بحر اليابان"
      ],
      "currectOption": 2
    },
    {
      "question": "ما هي أعلى قمة في العالم؟",
      "options":[
         "إفرست",
         "كيليمنجارو",
         "جبل فينسون",
         "جبل ماكينلي"
      ],
      "currectOption": 0
    },
    {
      "question": "ما هي الدولة التي ينبعث منها نهر الأمازون؟",
      "options":[
         "البرازيل",
         "بيرو",
         "كولومبيا",
         "إكوادور"
      ],
      "currectOption": 0
    },
    {
      "question": "ما هو الحيوان الذي يمكنه النوم لمدة تصل إلى 3 سنوات؟",
      "options":[
         "الدببة",
         "الخفافيش",
         "السحالي",
         "السنجاب"
      ],
      "currectOption": 0
    },
    {
      "question": "ما هو عدد الكواكب في المجموعة الشمسية؟",
      "options":[
         "7",
         "9",
         "12",
         "8"
      ],
      "currectOption": 2
    },{
      "question": " ",
      "options":[
        "",
         "",
         "",
         ""
      ],
      "currectOption": null
    },
]
